config/pen/documents/notes/ws/chemistry/reports/symbols.tex
% Created 2024-05-16 Thu 11:40
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.5in]{geometry}
\usepackage{fontspec}
\setmainfont{DejaVu Sans}
\author{Shane Mulligan}
\date{\textit{<2024-05-15 Wed>}}
\title{Chemistry acronyms and symbols table}
\hypersetup{
 pdfauthor={Shane Mulligan},
 pdftitle={Chemistry acronyms and symbols table},
 pdfkeywords={chemistry emacs},
 pdfsubject={},
 pdfcreator={Emacs 29.1.50 (Org mode 9.6.8)}, 
 pdflang={English}}
\begin{document}

\maketitle
\url{https://www.overleaf.com/learn/latex/Chemistry\_formulae}

\section{Table}
\label{sec:orgd53c1ac}

Goals:
\begin{itemize}
\item I want my own terminolgy and symbology for Chemistry that suits building my own reports.
\item I want it to match as closely as it can canonical symbols without losing intelligibility and consistency with my own format.
\item I want to be able to export into canonical symbols.
\end{itemize}

The shortcodes may be used even programmatically, such as in latex.

\begin{center}
\begin{tabular}{lllll}
Acronym & Term & Abbreviation & Shortcode & Glossary\\[0pt]
\hline
A.N. & Atomic Number & AN. & AN & \\[0pt]
E.N. & Electronegativity & EN. & EN & y:Electronegativity\\[0pt]
e.c. & Electron configuration & ec. & ec & \\[0pt]
I.E. & Ionisation Energy & IE. & IE & \\[0pt]
A.R. & Atomic Radius & AR. & AR & \\[0pt]
I.R. & Ionic Radius & IR. & IR & \\[0pt]
A⁻.R. & Anion Radius & A⁻R. & AnR & \\[0pt]
C⁺.R. & Cation Radius & C⁺R. & CaR & \\[0pt]
V.S.E.P.R. & Valence Shell Electron Pair Repulsion & VSEPR & VSEPR & y:VSEPR\\[0pt]
L180° & Linear & 2sets & 2se & \\[0pt]
TP120° & Trigonal planar & 3sets & 2se & \\[0pt]
TH109.5° & Tetrahedral & 4sets & 4se & y:Tetrahedral\\[0pt]
TBP120°90° & Trigonal bipyramidal & 5sets & 5se & \\[0pt]
OH90°90° & Octahedral & 6sets & 6se & \\[0pt]
l.p. & lone-pair & lp. & lp & \\[0pt]
\end{tabular}
\end{center}
\end{document}